sdaiGetADBTypePath(Sdai_ADBId*,System.Int32*)
\details
Retrieves the current type path for a specified attribute data block (ADB).
\param block [in] An attribute data block (ADB) instance.
\param typeNameNumber [out] A placeholder for the is a size of the path string array.
\returns A raw pointer to the string array that contains the type path if the path was successfully retrieved; otherwise, returns the NULL pointer.
\remarks
The type path consists of an array of strings that defines the path in the nested SELECT types hierarchy.